Exercises III

1. Use your get_db_url function to help you explore the data from the chipotle database.

In [9]:
import numpy as np
import pandas as pd
from sqlalchemy import text, create_engine
from pydataset import data

from env import get_connection

In [10]:
engine = create_engine(get_connection('chipotle'))

In [15]:
chipotle_query = '''

SELECT *
FROM orders
;

'''

In [16]:
chipotle_orders = pd.read_sql(text(chipotle_query), engine.connect())

In [47]:
chipotle_orders

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98
...,...,...,...,...,...,...
4617,4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75
4618,4619,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75
4619,4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Guacamole, Lettuce]]",$11.25
4620,4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettuce]]",$8.75
4621,4622,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Lettuce]]",$8.75

In [22]:
chipotle_orders.groupby('order_id').item_price.sum()

order_id
1       $2.39 $3.39 $3.39 $2.39
2                        $16.98
3                  $10.98 $1.69
4                  $11.75 $9.25
5                   $9.25 $4.45
                  ...
1830              $11.75 $11.25
1831          $9.25 $2.15 $1.50
1832                $8.75 $4.45
1833              $11.75 $11.75
1834         $11.25 $8.75 $8.75
Name: item_price, Length: 1834, dtype: object

In [28]:
# chipotle_orders_num = chipotle_orders.copy()

In [30]:
# chipotle_orders_num.head()

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98

In [43]:
# chip_float = [chipotle_orders.item_price.str.replace('$','').astype('float')]

/var/folders/__/8b23nn817hq5cnv1011jx8kr0000gn/T/ipykernel_14200/2369708716.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  chip_float = [chipotle_orders.item_price.str.replace('$','').astype('float')]

In [44]:
# pd.Series(chip_float)

0    0        2.39
1        3.39
2        3.39
3        2.39
4       16.98
        ...
46...
dtype: object

In [ ]:
# pd.concat([chipotle_orders, chip_float], axis=1)

In [49]:
chipotle_orders['chip_float'] = chipotle_orders.item_price.str.replace('$','').astype('float')

/var/folders/__/8b23nn817hq5cnv1011jx8kr0000gn/T/ipykernel_14200/1745566236.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  chipotle_orders['chip_float'] = chipotle_orders.item_price.str.replace('$','').astype('float')

2. What is the total price for each order?

In [51]:
# This is the AWNSER
chipotle_orders.groupby('order_id').chip_float.sum()

order_id
1       11.56
2       16.98
3       12.67
4       21.00
5       13.70
        ...
1830    23.00
1831    12.90
1832    13.20
1833    23.50
1834    28.75
Name: chip_float, Length: 1834, dtype: float64

3. What are the most popular 3 items?

Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506

In [67]:
chipotle_orders.groupby('item_name').quantity.agg('sum').sort_values(ascending=False).head(3)

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Name: quantity, dtype: int64

4. Which item has produced the most revenue?
Chicken Bowl

In [68]:
chipotle_orders.head()

,id,order_id,quantity,item_name,choice_description,item_price,chip_float
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39,2.39
1,2,1,1,Izze,[Clementine],$3.39,3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39,3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39,2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98,16.98

In [69]:
chipotle_orders.groupby('item_name').chip_float.agg('sum').sort_values(ascending=False).head(2)

item_name
Chicken Bowl       7342.73
Chicken Burrito    5575.82
Steak Burrito      3851.43
Name: chip_float, dtype: float64

5. Join the employees and titles DataFrames together.

In [ ]:
employees_query = '''
              SELECT *
              FROM employees
              '''

titles_query = '''
              SELECT *
              FROM titles
              '''

In [ ]:
employees = pd.read_sql(text(employees_query), engine.connect())
titles_query = pd.read_sql(text(roles   _query), engine.connect())